// Напишите программу, которая на вход принимает число и выдает его квадрат (число, умноженное на само себя).

Console.WriteLine("Enter a number: ");
int number = int.Parse(Console.ReadLine());
int result = number * number;
Console.WriteLine(result);